{
  "backend/main.mo": "Main backend actor implementing game rooms, player stats, user profiles, and leaderboard with role-based access control using MixinAuthorization for authentication and authorization.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (authentication, lobby system, turn-based combat, leaderboard, visual theme) to their corresponding files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON summary of all frontend files describing tactical military-themed UI components, authentication system, game lobby, turn-based combat board, and leaderboard implementation.",
  "frontend/index.css": "Tailwind CSS base styles with custom CSS variables for light and dark themes using OKLCH color space for tactical military palette.",
  "frontend/index.html": "HTML entry point for the Fire Fight application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for game lobby, game board, and leaderboard, wrapped in theme provider with authentication guards.",
  "frontend/src/components/ActionPanel.tsx": "Card component displaying Move and Attack action buttons for turn-based gameplay with disabled state management.",
  "frontend/src/components/AuthGuard.tsx": "Authentication wrapper component that displays loading or login prompt states when user is not authenticated, otherwise renders protected children.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright notice and caffeine.ai attribution link with UTM tracking parameters.",
  "frontend/src/components/GameGrid.tsx": "Interactive 10x10 grid battlefield component displaying player positions with clickable cells for movement and selection.",
  "frontend/src/components/Header.tsx": "Sticky header with Fire Fight logo, navigation links to lobby and leaderboard, login button, and responsive mobile menu.",
  "frontend/src/components/HeroBanner.tsx": "Hero banner component displaying Fire Fight title and Tactical Combat Arena tagline with background styling.",
  "frontend/src/components/LeaderboardTable.tsx": "Displays a ranked table of players with their scores, showing trophy icons for top 3 positions and truncated principal IDs.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that toggles between login/logout states using Internet Identity, with loading states and query cache clearing on logout.",
  "frontend/src/components/PlayerToken.tsx": "Displays a player card with avatar, name, health bar, and visual indication of active status.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name before accessing the game.",
  "frontend/src/components/RoomCard.tsx": "Card component displaying game room information (ID, player count, status) with a join button that navigates to the game room.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend mutations (save profile, create/join room, set position) and queries (leaderboard) with toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with tactical military-themed color palette for light/dark modes, custom animations, and component styling utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/GameBoard.tsx": "Main game board component that renders a tactical combat interface with a 10x10 grid, player tokens, turn management, and action panel for move/attack commands.",
  "frontend/src/pages/GameLobby.tsx": "Game lobby page displaying available rooms with player counts, allowing users to create new rooms or join existing ones, with user profile integration.",
  "frontend/src/pages/Leaderboard.tsx": "Leaderboard page that fetches and displays player rankings in a table format with loading states and trophy icon header.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both regular and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH, typography with Rajdhani display font, tactical-themed shadows, and animation utilities.",
  "project_state.json": "Project metadata tracking implemented features (authentication, lobby, combat, leaderboard, visual theme) and pending health/damage system feature request."
}